/********三国武将********/
//创建包含各武将的数组
var arr1 = ["吕布", "赵云", "典韦"];
var arr2 = ["关羽", "马超", "张飞"];
var arr3 = ["黄忠", "许褚", "孙策", "太史慈", "夏侯惇", "夏侯渊"];
var arr4 = ["张辽", "张颌", "徐晃", "庞德", "甘宁", "周泰", "魏延"];
var arr5 = ["张绣", "文丑", "颜良"];
var arr6 = ["邓艾", "姜维"];
//连接数组
var arr = arr1.concat(arr2, arr3, arr4, arr5, arr6);
//创建变量用来储存序号
var num = "";
//循环遍历
for(var i= 1; i < arr.length + 1; i++){
    //给小于10的序号前面补0
    if(i < 10){
        num = "0" + i ;
    }else{
        num = i;
    }
    //输出结果
    console.log(num + ":" + arr[i - 1]);
}