/********水浒座次表********/
//建立数组
var star = ["天魁星", "天罡星", "天机星", "天闲星", "天勇星", "天雄星", "天猛星", "天威星", "天英星", "天贵星"];
var nickName = ["及时雨", "玉麒麟", "智多星", "入云龙", "大刀", "豹子头", "霹雳火", "双鞭", "小李广", "小旋风"];
var trueName = ["宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进"];
//建立变量用来储存序号
var num = "";
//循环遍历
for (var i = 1; i < star.length + 1; i++) {
    //给小于10的序号前面补0
    if(i < 10){
        num = "0" + i ;
    }else{
        num = i;
    }
    //输出座次
    console.log("忠义堂座次：" + num + "-" + star[i - 1] + "-" + nickName[i - 1] + "-" + trueName[i - 1]);
}